Repository: raccoongang/DoneXBlock
Catalog: done/translations/*/LC_MESSAGES/text.po
Languages: pt_br

source: Is the student done?
pt_br: O aluno terminou?

source: Align left/right/center
pt_br: Alinhar esquerda/direita/centro

source: Completion
pt_br: Conclusão

source: Display name
pt_br: Exibir o nome

source: ISO-8601 formatted string representing the start date of this assignment. We ignore this.
pt_br: Texto formatado em ISO-8601 representando a data de início desta tarefa. Nós ignoramos isso.

source: ISO-8601 formatted string representing the due date of this assignment. We ignore this.
pt_br: Texto formatado em ISO-8601 representando a data de vencimento desta tarefa. Nós ignoramos isso.

source: Problem Weight
pt_br: Peso do Problema

source: Defines the number of points each problem is worth. If the value is not set, the problem is worth the sum of the option point values.
pt_br: Define o número de pontos que cada problema vale. Se o valor não for definido, o problema vale a soma dos valores de pontos da opção.

source: I have completed this
pt_br: Eu completei este

source: This is a very simple component with no configuration options. It is used for helping student keep track of what portion of a course they've completed. For example, you might place this underneath each text and video component, and students can see in their progress page which portions are completed and which still need to be watched or read.
pt_br: Este é um componente muito simples, sem opções de configuração. É usado para ajudar o aluno a acompanhar qual parte de um curso eles concluíram. Por exemplo, você pode colocar isto embaixo de cada componente de texto e vídeo, e os alunos podem ver na sua página de progresso quais partes estão concluídas e que ainda precisas ser assistidos ou lidos.

source: It is also helpful to give students a way to sign off on having completed something. They are less likely to skip material that way.
pt_br: Também é útil dar aos alunos uma maneira de assinar tendo concluido alguma coisa. Eles são menos propensos a pular o material dessa maneira.

source: (If you're a real power-user, in OLX, we do allow you to add an align tag, which can left-, center-, or right-justify the XBlock)
pt_br: (Se você é um verdadeiro usuário avançado, no OLX, nós permitimos que você adicione uma tag de alinhamento, que pode justificar à esquerda, ao centro ou à direita do XBlock)
